insert into kintai.staff_table(`ID`,`NAME`,`NAMEKANA`,`ENTRY_YEAR`,`GENDER`,`CLASS_ID`) values 
    (1,'中島　祐介','ナカシマユウスケ',2018,'男','1')
  , (7,'中村　晃','ナカムラ　アキラ',2007,'男','0')
  , (47,'大関　友久','オオゼキ　トモヒサ',2019,'男','0')
  , (125,'櫻井　翔','サクライ　ショウ',1982,'男','0')
  , (505,'野原　しんのすけ','ノハラ　シンノスケ',1985,'男','0')
  , (617,'二宮　和也','ニノミヤ　カズナリ',1983,'男','0')
  , (668,'11111','ファイル',2025,'男','2')
  , (711,'坂口　健太郎','サカグチ　ケンタロウ',1991,'男','0')
  , (830,'松本　潤','マツモト　ジュン',1983,'男','0')
  , (1023,'渡辺　直美','ワタナベ　ナオミ',1987,'女','0')
  , (1126,'大野　智','オオノ　サトシ',1980,'男','0')
  , (1224,'相葉　雅紀','アイバ　マサキ',1982,'女','0');
