-- --------------------------------------------------------
-- 適用マスタデータ投入
-- 各区分の意味（労働/休日/有給）を定義して登録する
-- --------------------------------------------------------
DELETE FROM abstract_master;
INSERT INTO abstract_master (
    ID,
    NAME,
    IS_WORK,
    IS_PAID,
    IS_LEGAL_HOLIDAY,
    IS_PRESCRIBED_HOLIDAY
  )
VALUES -- ID, 名称, 労働FLG, 有給FLG, 法定休FLG, 所定休FLG
  ('1', '出勤', 1, 0, 0, 0),
  -- 通常出勤
  ('10', '休日', 0, 0, 1, 0),
  -- 法定休日（日曜など）と仮定
  ('2', '休出', 1, 0, 0, 1),
  -- 所定休日労働（土曜出勤など）と仮定
  ('3', '有給', 0, 1, 0, 0),
  -- 有給休暇（労働ではないが給与あり）
  ('4', '代休', 0, 0, 0, 0),
  -- 休み
  ('5', '半休', 1, 0, 0, 0),
  -- 労働日として扱い、時間は実働で計算
  ('6', '特休', 0, 0, 0, 0),
  -- 特別休暇
  ('7', '振出', 1, 0, 0, 0),
  -- 振替出勤（平日扱い）
  ('8', '振休', 0, 0, 0, 0),
  -- 振替休日
  ('9', 'その他', 0, 0, 0, 0);